[
  {
    "title": "[sticky] please report spam here when you see it. afraid you might be spamming? you probably are.",
    "text": "To the few users who are reporting spam: thank you.  I appreciate it.  Sometimes it's not obvious because they're tech articles and I don't have time to check user profiles etc...\n\nTo those who haven't noticed much spam: that's probably because it's not \"traditional\" spam. They're not links to scam or porn sites - it's users abusing /r/javascript and using it as a promotional tool to get traffic to their (usually ad-ridden) blogs.\n\nI don't want to discourage users from posting their own content. The nature of programming is that you want to share your stuff.  You should clearly say in the title or comments that it's your own, and you should at least make some effort to participate in other threads in /r/javascript if you can.\n\nIf you want to post your own stuff, you should read the reddiquette and understand reddit's rules.  You should be an active participant in the reddit community, and you must still mostly post useful and interesting things that are not your own content.  We tend to be a little more lax than reddit's [self promotion guidelines](http://www.reddit.com/wiki/selfpromotion) (e.g. the suggested 90/10 rule), but that doesn't mean we're not keeping an eye on people who are just posting here for SEO / driving ad traffic.\n\nIf it's clear you just created the account so that you could promote your blog/posts on reddit, you may be banned from posting here. This isn't a free promotional tool for you to drive traffic or increase SEO, and spamming /r/javascript will not be tolerated.\n\nWe mods need your help, readers, in identifying spammers.  Thanks to those already helping out!",
    "link": "http://www.reddit.com/r/javascript/comments/1qyqvn/sticky_please_report_spam_here_when_you_see_it/",
    "ups": 50,
    "downs": 0,
    "author": "honestbleeps",
    "comments": [
      {
        "author": "gibletor",
        "replies": [
          {
            "author": "newSuperHuman",
            "replies": [],
            "text": "I agree.  95% of what I know about javascript comes from pages that are riddled with ads.",
            "ups": 7,
            "downs": 0
          },
          {
            "author": "NULLACCOUNT",
            "replies": [
              {
                "author": "gibletor",
                "replies": [
                  {
                    "author": "honestbleeps",
                    "replies": [],
                    "text": "I will say that the quality of the source is taken into account, but at the very minimum if I notice people 'spamming, but spamming \"good\" content', we can and should encourage them to engage with the community.\n\nso far though I'm mostly removing crappy blogspam that looks like a moderately OK article at a skim/glance, but is generally low quality.\n\nreddit sells ads if people just want to get more traffic.",
                    "ups": 2,
                    "downs": 0
                  }
                ],
                "text": "reddiquette is not a formal set of rules. It also says:\n\n* you should moderate based on quality\n* submit original sources of content\n* submit content appropriate to the subreddit\n* vote on appropriateness\n* actually read articles \n* \"feel free to post links to your own content\"\n* use an \"innocent until proven guilty\"\n* don't moderate a story based on your opinion of its source.\n* don't upvote or downvote based just on the person that posted it.\n\nGranted, the actual reddit rules state that it's not OK to only post links to your own content, but I still feel like this is a overly-generalized rule.\n\nI'm still not convinced as to why, as a reader of this sub, I should care about submissions coming directly from original content creators who aren't particuarly active on reddit otherwise. Shouldn't the quality of the source material be the primary criteria? ",
                "ups": 12,
                "downs": 0
              }
            ],
            "text": "This is actually a reddit-wide rule, not specific to this sub. I believe in reddiquette it says something like no more than ~~30%~~ (Just looked it up. It's no more than 10% as a rule of thumb) of what you submit should be your own content.",
            "ups": 6,
            "downs": 0
          },
          {
            "author": "PlNG",
            "replies": [
              {
                "author": "gibletor",
                "replies": [],
                "text": "Examples of what?",
                "ups": 4,
                "downs": 0
              }
            ],
            "text": "Examples?",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "If the content is relevant to the sub, then I really don't see the problem with self-promotion. Let's the votes decide whether it belongs or not; I really don't like it when moderators act as content arbitrators. \n\nThe content here is just fine, IMHO. You guys ought to be focusing your efforts on improving the quality of discussion in this sub, which is just downright deplorable.",
        "ups": 55,
        "downs": 0
      },
      {
        "author": "callumacrae",
        "replies": [
          {
            "author": "mailto_devnull",
            "replies": [
              {
                "author": "fgutz",
                "replies": [
                  {
                    "author": "callumacrae",
                    "replies": [],
                    "text": "http://www.reddit.com/r/javascript/comments/20w3wa/regex_tuesday/ :-)",
                    "ups": 3,
                    "downs": 0
                  }
                ],
                "text": "Can regex tuesday come back?",
                "ups": 4,
                "downs": 0
              }
            ],
            "text": "Definitely not spam (in my opinion)! Because of you, [I learned regex](http://www.codinghorror.com/blog/2008/06/regular-expressions-now-you-have-two-problems.html).",
            "ups": 6,
            "downs": 0
          },
          {
            "author": "honestbleeps",
            "replies": [
              {
                "author": "gibletor",
                "replies": [
                  {
                    "author": "honestbleeps",
                    "replies": [
                      {
                        "author": "gibletor",
                        "replies": [
                          {
                            "author": "honestbleeps",
                            "replies": [
                              {
                                "author": "gibletor",
                                "replies": [],
                                "text": "&gt; has his content been removed?\n\nNo, but according to everything you've said here so far, it *should* be removed due to this user not being an active redditor. Given that I didn't exactly seek this guy out or cherry pick to find him, I have to believe there are more users like him.\n\nThis is why I said elsewhere that I don't agree that this isn't a matter that is up for debate. Clearly, there is a distinction between self-promotion and spam, and determine which is which is not as simple as just looking at user history.",
                                "ups": 9,
                                "downs": 0
                              },
                              {
                                "author": "callumacrae",
                                "replies": [
                                  {
                                    "author": "honestbleeps",
                                    "replies": [
                                      {
                                        "author": "callumacrae",
                                        "replies": [],
                                        "text": "I'm not sure why anyone would want to link to that domain anyway - if you were going to link to a book, you'd link to either Amazon or the publisher (I think I linked to the publisher for mine, and it was well received).\n\nI'm not trying to defend them if it is them, though.",
                                        "ups": 2,
                                        "downs": 0
                                      }
                                    ],
                                    "text": "it could well be someone besides them.\n\nI'm not suggesting we're going to ban posts to that domain -- just users who do nothing but post links to the same domain, because it's against reddit's rules.  \n\nreddit sells ad space -- cheaply and self-serve -- it's not fair to let people spam \"because they spam something we kind of like\"...",
                                    "ups": 2,
                                    "downs": 0
                                  }
                                ],
                                "text": "Safari Books Online are *huge*, and I learned about them from the preface of my own book - it seems weird that they'd stoop to spamming Reddit. Are you sure it's them, or just a bot trying to get karma?",
                                "ups": 2,
                                "downs": 0
                              }
                            ],
                            "text": "has his content been removed?\n\nno. with the exception of one post that wasn't removed by a moderator, it was detected by **reddit** as spam.\n\nhe also doesn't post all that frequently. he has posted 5 different links in the past year.\n\nthis is different from someone [like this user](http://www.reddit.com/user/kelluvuus/) who is now banned from /r/javascript.  this user had posted a link almost every 2 or 3 days for the course of 4 weeks, but you won't see it in their history because we removed it.\n\nit's not just \"this is my blog about javascript\", either. it's all stuff about his/her products.\n\nthen there's [this user](http://www.reddit.com/user/bherbstman/) who is clearly just trying to drive traffic to sell his products by driving traffic there.  any of \"his\" posts with any meaningful content seem to be contributed by \"guests\", meaning he's probably getting some poor (unpaid) bastard to write good js content for him just to drive traffic there.\n\nthat \"safari books online\" site's primary aim is selling books. allowing them to spam here is not fair to anyone wanting to buy an ad, or anyone who creates content and engages with the community.",
                            "ups": 1,
                            "downs": 0
                          }
                        ],
                        "text": "As a counter-example, the very first submission I came across in r/javascript/new is from /u/markdalgleish, who seems to post exclusively in this sub and who has 0 comment karma. By your rules(by way of reddit's rules), this guy's stuff should be removed, no questions asked. \n\nHowever, the content of his subsmissions actually seems to be fairly original and high-quality, and there don't seem to be any ads on his site. Removing his content solely on the basis that he's not an active redditor seems fairly arbitrary, to be honest.",
                        "ups": 1,
                        "downs": 0
                      }
                    ],
                    "text": "[this, as an example](http://www.reddit.com/user/bherbstman/) is not OK. it's not just my decision, it's reddit's decision. this isn't a subreddit rule, this is a reddit-wide rule.\n\nalso, this isn't exactly high quality content.",
                    "ups": 0,
                    "downs": 0
                  }
                ],
                "text": "&gt; those are very clearly on the wrong side of the line without any real debate about it.\n\nI realize this isn't really a democracy, but I disagree with you completely and I feel like there needs to be some debate here. \n\nAs I said elsewhere, if the content is relevant to this sub's readers, then what exactly is the problem? That they're not joining in discussion? Because there generally is not a lot of fruitful discussion to be had here, and that's no fault of the content creators, but of the moderators.",
                "ups": 5,
                "downs": 0
              }
            ],
            "text": "those were a custom curated activity that got people participating... i don't recall if you were linking to your own site and if it had ads, etc... but that was the sort of thing the community clearly tacitly approved of so I'd be fine with it personally... \n\nthere's other posters on here who it's obvious do nothing but post links to their blog (virtually NO comments, etc) -- those are very clearly on the wrong side of the line without any real debate about it.",
            "ups": 4,
            "downs": 0
          }
        ],
        "text": "I have a question on this topic: when I used to run Regex Tuesday (see my post history), I would submit one link a week to it, far outweighing my other content (but I did submit other content whenever I found it). Was that okay? People usually liked them, and I didn't earn anything from it, I just liked to see people learn from it.\n\nThanks for the awesome sub.",
        "ups": 13,
        "downs": 0
      },
      {
        "author": "[deleted]",
        "replies": [
          {
            "author": "kenman",
            "replies": [
              {
                "author": "[deleted]",
                "replies": [],
                "text": "Thats my point. It was reddit software, that auto shadowbanned him.\n\nIt totally discouraged him to continue contributing.\n\nAll the php mods tryed to talk about him rigth.\n\nNo one listened. I havent seen him really back. I think he returned for a while to talk about the topic, but left afterwards with a bad feeling about this place.",
                "ups": 3,
                "downs": 0
              }
            ],
            "text": "I could have sworn that he made a reappearance, and the fact that his user page (/u/ircmaxwell) still exists seems to support that. Typically when someone is banned their user page shows \"there's nothing here\", but his is still intact -- though it looks like all his submissions have been removed, as well as most of his comments.\n\nAlso, keep in mind that he was banned by reddit admins on their own volition, which the mods of /r/php disagreed with (on account of ircmaxwell actually being an active redditor that participated in discussions).",
            "ups": 2,
            "downs": 0
          }
        ],
        "text": "Have you read about the /u/ircmaxwell Incident?\n\nhe is a great php developer (according to /r/php) and was baned becouse he only posted links to his blog (very informative)\n\nOnce banned he never came back (well, i stopped following /r/php near that time too) for these \"rules\"\n\n",
        "ups": 7,
        "downs": 0
      },
      {
        "author": "kenman",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [
              {
                "author": "PenguinLovr",
                "replies": [],
                "text": "Ya know github is a public representation of your identity. Maybe that's why he has no other history;  Maybe he has another reddit account which he uses personally, and uses this one to spread awareness about his code?",
                "ups": 3,
                "downs": 0
              },
              {
                "author": "kenman",
                "replies": [],
                "text": "I edited my comment after I discovered that he's [involved in divshot.com](http://www.divshot.com/about.html) which he also posted, and that is [definitely a paid service](http://www.divshot.com/pricing.html).\n\nAnd he's posted fasten.io, though it doesn't have any ads or other monetization [yet?], it also provides nothing of value (i.e. no code or code discussion). Just a landing page for a service.\n\nI agree that he's pretty much in a gray area though.",
                "ups": 1,
                "downs": 0
              }
            ],
            "text": "a good find, and an interesting potential exception to the rule.\n\nhe is linking his own projects, but they're github repos and not blogspam articles with ads... there's no real path to monetization here.\n\narguably he's contributing to the community via code, but not really being a great participant because he doesn't do anything on reddit BUT post his code.\n\nhe certainly falls into a much more legitimate \"gray area\" here and while I've removed one or two of his posts before, I haven't removed the rest for that reason.",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "What about /u/scottcorgan?\n\n* all of his 11 submissions promote his own stuff\n* only 1 comment, naturally promoting his own stuff\n\np.s. Ideally I'd like to see some form of outreach before an outright ban, as I think many are not familiar with reddit and don't know better. I'd hate to welcome them with a ban...",
        "ups": 5,
        "downs": 0
      },
      {
        "author": "cymen",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [],
            "text": "you also clearly have been a redditor for a while (albeit mostly a lurker), and you don't repeatedly post that domain here.\n\nthere are only 2 accounts banned from /r/javascript right now, and both of them were created let's say X weeks ago and did NOTHING but post every single blog entry they ever wrote from X weeks ago 'til now.\n\nthat is just not OK.",
            "ups": -2,
            "downs": 0
          }
        ],
        "text": "So a month or so ago I posted a link to a blog post on the company I work for. That post is here:\n\nhttp://www.reddit.com/r/javascript/comments/1n9e6g/modular_javascript/\n\nI appreciated getting some good feedback. There are no ads on our company website. Obviously, it is a company website. But I this kind of post is something I'd personally appreciate reading. It's not about the company/person, it's about the topic to me. I'm not saying my post is excellent. It doesn't apply for a lot of people. But I appreciate getting feedback that is relatively anonymous so I know what people actually think.\n\nBecause this account uses my real name, I tend not to post to it on Reddit. So my post history is not going to show activity here. If I was to game the system, I could post it with another account and not mention it was something I wrote. I think people are clearly going to do the later if the policy is as black and white as the original post outlines.\n\nEdit: I know see the point about Reddit policy in general. I will abide by it unless it is clear we are going to be lax on the rules here. I do agree it is better if someone else finds something I wrote and posts it because they found it interesting enough to share rather than me assuming it will be interesting and posting it myself. It is tricky though because what if people never find it? I guess that is just a trade off. I do think there will be people gaming the system though which is unfortunate.",
        "ups": 4,
        "downs": 0
      },
      {
        "author": "Cixis",
        "replies": [],
        "text": "Here's one. http://www.reddit.com/user/markdalgleish",
        "ups": 3,
        "downs": 0
      },
      {
        "author": "geedew",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [],
            "text": "you don't post nearly enough enough to reddit in general (unless you're going back and deleting your comments etc) to really even be looked at as a problematic spammer.\n\n[the general rules of reddit for self promotion are here](http://www.reddit.com/wiki/selfpromotion)\n\nhowever, I tend to be a little more lax than that in cases where people are posting links to articles on programming blogs they've written because those sorts of people don't tend to be as prolific / frequent in self promotion even if they don't follow the \"90/10 rule\"\n\nWhere things become problematic are people who keep writing \"10 great X plugins to do Y\" blog posts just to get hits, or where people constantly post to their corporate blog (e.g. packtpub which has been a pretty egregious offender)...\n\nTL;DR: you're fine, keep doing what you're doing.",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "The more I read this the more I plan not to contribute to this Sub-Reddit. I try to encourage communication, but in the little posting I do, they are all to my blog and it does have an ad. I do link to many sources on my blog posts and they are all original content, with little rehash. But looking at the comments here, I can't help but feel this community down votes just because I only post my own blog.... I can't imagine if Chris from css-tricks tried to post his own content here anyone would complain, even if that's all he did, and he would make more money from all the ads he has (as an example). Am I the only one that sees some of these comments this way? That I am breaking some contribution rule? Am I walking a thin line?\n",
        "ups": 3,
        "downs": 0
      },
      {
        "author": "PlNG",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [
              {
                "author": "PlNG",
                "replies": [
                  {
                    "author": "gibletor",
                    "replies": [],
                    "text": "That won't do squat if we are indeed talking about bots, unfortunately.",
                    "ups": 3,
                    "downs": 0
                  }
                ],
                "text": "Can't stop the downvoting, you but can make it more difficult by hiding the button through subreddit styles.",
                "ups": 0,
                "downs": 0
              }
            ],
            "text": "i agree that's a problem, but mods can't stop downvoting from happening unfortunately :(\n\nit could very well be these spammer/bloggers downvoting other stuff to get theirs up though.. so reporting and getting those people banned may help.",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "I'm more concerned about the downvoting of [legitimate submissions](http://www.reddit.com/r/javascript/comments/1qo3tt/boolean_bot_a_javascript_implementation_of_the/) than the \"spam\".",
        "ups": 5,
        "downs": 0
      },
      {
        "author": "CodeGeekzSpams",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [],
            "text": "i've removed a fair amount of codecondo posts from here. the other things that guy posts it's hard to tell if they're \"his\"... \n\nI'd suggest /r/reportthespammers for the guy if you think he is involved with / owns all/most of those sites.",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "http://www.reddit.com/domain/webdesignerdepot.com/\n\nhttp://www.reddit.com/domain/codecondo.com/\n\nhttp://www.reddit.com/user/skillcode\n\nThis is getting out of hand.",
        "ups": 2,
        "downs": 0
      },
      {
        "author": "[deleted]",
        "replies": [
          {
            "author": "[deleted]",
            "replies": [],
            "text": "Look at the submitter's account history. If it's nothing but links to their blog, report them. Users who actually participate in discussion and feedback to their articles are OK. \n\nIt's the links-only people/bots who are the problem. ",
            "ups": 2,
            "downs": 0
          },
          {
            "author": "honestbleeps",
            "replies": [],
            "text": "No, of course many if not most posts will have ads. \n\nThe idea is that people posting their own blog or site exclusively are abusing reddit and should be reported ",
            "ups": 2,
            "downs": 0
          }
        ],
        "text": "[deleted]",
        "ups": 2,
        "downs": 0
      },
      {
        "author": "kenman",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [
              {
                "author": "kenman",
                "replies": [],
                "text": "Haha, I kind of gathered that one of them was banned recently, thus causing them to create a new account. Thanks for looking into it!",
                "ups": 1,
                "downs": 0
              },
              {
                "author": "kenman",
                "replies": [
                  {
                    "author": "honestbleeps",
                    "replies": [
                      {
                        "author": "quietchaos",
                        "replies": [
                          {
                            "author": "honestbleeps",
                            "replies": [],
                            "text": "thanks!",
                            "ups": 1,
                            "downs": 0
                          }
                        ],
                        "text": "they're back again, this time through their blog:\n\n/u/LanaX",
                        "ups": 1,
                        "downs": 0
                      }
                    ],
                    "text": "thanks, i'm just gonna ban the domain",
                    "ups": 1,
                    "downs": 0
                  }
                ],
                "text": "They're back!\n\n/u/ya6adu6adushechka\n\nI reported already, but figured I'd follow-up here since they're becoming problematic.",
                "ups": 1,
                "downs": 0
              }
            ],
            "text": "thanks, I'll h ave a look - appreciate the heads up!\n\nedit: one of those two guys was the one who was banned / inspired this post.",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "These are probably the same person, as they _only_ post webix.com links:\n\n* /u/ya6adu6adu\n* /u/kelluvuus\n\nNo real discussion out of either of them too.\n\nIt might be worth getting reddit to ban webix.com wholesale:\n\n* http://www.reddit.com/domain/webix.com/\n\nOut of 16 submissions, they're sitting very close to 0 net karma.\n\nI should point out that the webix software [is not always free](http://webix.com/licences/).",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "PenguinLovr",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [],
            "text": "probably not. you should be fine.",
            "ups": 0,
            "downs": 0
          }
        ],
        "text": "If I plan on relasing a new JavaScript framework and I make a new account to do this because I don't want my real identity (github) to be associated with my reddit account...will it be considered spam because I am a new user with no post history? ",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "raiseurdonger",
        "replies": [
          {
            "author": "cougar32",
            "replies": [],
            "text": "What makes you think your spamming?",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "im afraid i might be spamming",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "kenman",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [],
            "text": "thank you",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "Another to consider: /u/draganmatek",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "thanpolas",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [
              {
                "author": "thanpolas",
                "replies": [
                  {
                    "author": "honestbleeps",
                    "replies": [
                      {
                        "author": "thanpolas",
                        "replies": [],
                        "text": "oh cool, hiding it is!",
                        "ups": 1,
                        "downs": 0
                      }
                    ],
                    "text": "nobody's complained about the sticky post until now (you), and dozens of people have messaged me to point out spammers because of it, so I think it has helped keep people vigilant.\n\nif there's a big outcry for me to remove the sticky, I'll remove it. you can always hide it, you know.",
                    "ups": 1,
                    "downs": 0
                  }
                ],
                "text": "i see... so do you feel this banner helps? Maybe if the offenders are kindly directed to this post it would work for all?",
                "ups": 1,
                "downs": 0
              }
            ],
            "text": "there's actually quite a lot of it.",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "Do we need this in such a prominent place? Have you noticed spam in this subreddit?",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "kenman",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [
              {
                "author": "CodeGeekzSpams",
                "replies": [
                  {
                    "author": "honestbleeps",
                    "replies": [
                      {
                        "author": "CodeGeekzSpams",
                        "replies": [
                          {
                            "author": "kenman",
                            "replies": [
                              {
                                "author": "wdpttt",
                                "replies": [
                                  {
                                    "author": "kenman",
                                    "replies": [
                                      {
                                        "author": "wdpttt",
                                        "replies": [],
                                        "text": "I understand. (Anyway you can see from the site that there is not even one ad.)",
                                        "ups": 1,
                                        "downs": 0
                                      }
                                    ],
                                    "text": "You can definitely still post, it's just that you need to behave like a normal redditor, and not someone just trying to drive traffic to their own site. As I alluded to in that [other comment](http://www.reddit.com/r/javascript/comments/22k6ie/react_js_learn_the_basics_the_right_way_knowledge/cgo3gll), you need to only submit your own site 10% of the time (at most). Your submissions have been fairly successful, and you do participate in discussions (which is good), it's just that it _appears_ that the only reason you're here is to promote your site, which is the wrong reason to be here. \n\nIf all you really want is web traffic, reddit has [an advertising program](http://www.reddit.com/ad_inq/), but by posting so many links to your own site you make it unfair to those who do pay for advertising (as well as rob reddit of money it could use). That's why it's such a touchy issue and why the admins take it seriously.",
                                    "ups": 2,
                                    "downs": 0
                                  }
                                ],
                                "text": "Hello!\nI'm the guy from webdesignporto. I'm just posting my own content, what I've been writing. I've also posted a post as guest author (he asked me to do it) on the CodeGeekz.com http://codegeekz.com/react-js-tutorial/ so this is my only link with them.\n\nAbout \"another new user, /u/wdpttt, suspiciously posts a lot of links to the geekz sites, as well as webdesignporto.com...\" I've only posted one link to codegeekz, that was my own post. The rest of the posts are from my own website webdesignporto.com\n\nI hope there are no doubts about who I am. Anyway it seems that I cannot post anymore, as I've been warned in a comment about a possible ban, but then I might think: nobody will see my posts. Anyway I have to figure out something that has nothing to do with reddit...\n\nAnd I only use this account.",
                                "ups": 1,
                                "downs": 0
                              }
                            ],
                            "text": "Yeah there's definitely something going on here, thanks for the info!",
                            "ups": 2,
                            "downs": 0
                          }
                        ],
                        "text": "Another one of their \"scrape mailing lists and create lists\" websites.\n\nhttp://www.reddit.com/domain/webdesignporto.com/ CTRL + F: \"wdpttt\".\n\nRecently posted here: http://www.reddit.com/r/javascript/comments/22k6ie/react_js_learn_the_basics_the_right_way_knowledge/\n\nedit: Just realised kenman actually reported this a month ago, but for codegeekz not webdesignporto",
                        "ups": 2,
                        "downs": 0
                      },
                      {
                        "author": "CodeGeekzSpams",
                        "replies": [],
                        "text": "Thank you, it makes this subreddit a lot more enjoyable!",
                        "ups": 1,
                        "downs": 0
                      }
                    ],
                    "text": "he's been reported via /r/reportthespammers already - but i'll certainly have a look also.",
                    "ups": 1,
                    "downs": 0
                  }
                ],
                "text": "http://www.reddit.com/user/CreativePunch has started to use the same tactics. CodeGeekz has loads of usernames they delete after using or commenting with.",
                "ups": 2,
                "downs": 0
              }
            ],
            "text": "the admins can look into this pretty easily, i'll pass this on to them, thanks!",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "Some of this is speculation, but here's what I've noticed about some odd users, namely, /u/geekz_gm and /u/wtd_, but as I investigated I discovered at least 2 more accounts that are probably linked:\n\n* accounts created within a week of each other\n* most of their comments are in the other's posts (wtd_ comments almost exclusively in geekz_gm's posts)\n* the domains codegeekz.com and designgeekz.com are favorite postings (see a theme here? \"geekz\")\n* found a 3rd account that is suspiciously similar, /u/wtd_gm, but it's gone.... hrmm, wonder why?\n* the 3rd account was found after noticing that they also post a lot of links from webtoolsdepot.com\n* another new user, /u/wdpttt, suspiciously posts a lot of links to the geekz sites, as well as webdesignporto.com... \n\nIt looks like, possibly after /u/wtd_gm got banned, they wisened up and learned to mix in 3rd party submissions with their own so as not to appear like the spammer they are, but the web is easily untangled.\n\nI don't have any more time to waste on this right now, but this is all starting to look like a sophisticated spam ring. I'm not sure if it's all the same person, or a coordinated group of back-scratchers, but something is definitely fishy here... the coincidences that I'm uncovering are just too uncanny to be the result of random chance.\n\nI think when I get home I'll do a little more digging and see if this is worthy of /r/ReportTheSpammers.",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "[deleted]",
        "replies": [
          {
            "author": "darkane",
            "replies": [],
            "text": "This is not spam. It's a video released by the AngularJS team and submitted by a very active user with zero personal or professional connection to it.",
            "ups": 1,
            "downs": 0
          },
          {
            "author": "honestbleeps",
            "replies": [
              {
                "author": "[deleted]",
                "replies": [
                  {
                    "author": "honestbleeps",
                    "replies": [],
                    "text": "&gt; I'd also like to think that I've been submitting things of actual interest :)\n\nthey do seem to be of actual interest, just be aware that \"of interest\" doesn't erase [reddit's guidelines on self promotion](http://www.reddit.com/wiki/selfpromotion)",
                    "ups": 2,
                    "downs": 0
                  }
                ],
                "text": "[deleted]",
                "ups": 1,
                "downs": 0
              }
            ],
            "text": "it's a pretty straightforward case of a good video actually...\n\nyou, on the other hand, created your account solely to promote your work on the same domain name... tread lightly :-)",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "[deleted]",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "loveless01",
        "replies": [],
        "text": "I agree, initially I was like \"do I really care whether the author is self promoting or not?\", but then I realised that the most personally useful articles about hard stuff I had read had interesting discussions with the author participating, which obviously what you are aiming for.",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "seglosaurus",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [
              {
                "author": "seglosaurus",
                "replies": [],
                "text": "It's a personal blog.  I have no ads on it.  I feel it's directly relevant to AngularJS/Chrome Extension/reddit development using JS.  I'll admit, I use alternate accounts these days.  This has since become my primary account and the one I will promote my own posts with.  I don't post that often.",
                "ups": 1,
                "downs": 0
              }
            ],
            "text": "it's pretty simple.  is it a personal blog, or a blog like packtpub.net that has ads and/or is selling a service?  If personal, continue:\n\nI take a quick peek at your user profile and I see lots of comments and participation on reddit.  Seems good to me.  you should post your blog article. \n\nBasically, the 90/10 rule applies.  90% of your interaction on reddit (preferably more) should be commenting, posting stuff that isn't yours, etc.  Posting your own stuff is fine.\n\nThat's not my personal rule of thumb, it's reddiquette's / the reddit wiki on selfpromotion.",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "I was just about to post a blog article I had written, but this sticky sure gives me a lot of pause.  After spending 10 minutes reading this thread I can't really get a consensus about when it's OK to post your own material and when it's not.  It's kind of sad, really.  To avoid being flamed out of this sub I'll refrain from posting it...",
        "ups": 1,
        "downs": 0
      }
    ]
  },
  {
    "title": "webkit.js (pure javascript webkit impl.) new demo - now with hardware acceleration",
    "text": "",
    "link": "http://trevorlinton.github.io/",
    "ups": 41,
    "downs": 0,
    "author": "ns0",
    "comments": [
      {
        "author": "Buckwheat469",
        "replies": [
          {
            "author": "ns0",
            "replies": [],
            "text": "It's 4.3MB of compressed code, as soon as emscripten supports proxying webgl to canvas from a worker that'll be taken care of.\n\nhttps://github.com/kripken/emscripten/issues/2396",
            "ups": 4,
            "downs": 0
          }
        ],
        "text": "The developer might want to add some timeouts to help offset the load. When it renders the image it blocks the browser from scrolling. I haven't looked at the code to find out where the appropriate places would be for these.",
        "ups": 4,
        "downs": 0
      },
      {
        "author": "Zequez",
        "replies": [
          {
            "author": "ns0",
            "replies": [
              {
                "author": "guitarromantic",
                "replies": [
                  {
                    "author": "ns0",
                    "replies": [
                      {
                        "author": "agmcleod",
                        "replies": [
                          {
                            "author": "ns0",
                            "replies": [],
                            "text": "webkit.js uses the exact same code base as QT, GTK, Apple, Chromium. Everyone uses software drawing/painting.  Almost all use compositing, most use accelerated compositing. \n\nThe next (and probably final) step in rendering is getting primitives to draw with GL. When you use HTML and put text on the screen a font library kicks up, calculates all of the shapes sends it to a graphics library like Skia or Cairo and that is rendered to a bitmap, put into either GL as a texture (think of it being painted on glass) then the seperate peices of classes placed over each other (compositing).  \n\nGLSL/Vertex Shaders have the luxury of asking the hardware to do this. You completely skip compositing, painting, everything. You upload your shape, and a texture (color, gradient, image, whatever) then hit render and the GPU takes it from there.  This is essentially how 3D video games have worked for a very long time. Due to a range of issues from standards, patents and complexity its never really made it into webkit or any other browser i know of.\n\nI do (or at least I had heard) chromium was making a new \"backing layer\" to Skia called Ganeash, which does just this. But I about 8 months ago I couldn't find a single reference to any of it in their sources. ",
                            "ups": 1,
                            "downs": 0
                          }
                        ],
                        "text": "It's possible we'll get there, but the minimal developer overhead with html &amp; css is pretty hard to ignore. I really need to look up how the rendering pipeline of the browser works, but if that was to run more on the GPU, it could help a lot.\n\nDo you know what the browser uses for rendering at the end of the day? Something similar to that of GUI components in a desktop app, like you would build with QT?",
                        "ups": 1,
                        "downs": 0
                      }
                    ],
                    "text": "Basically one day your browser will just be an opengl context ( a way of telling your graphics card to paint something ), javascript, websockets, webworkers and maybe some audio/video apis.\n\nRendering is more than likely going to move to be straight javascript, browsers will refocus on features, functionality, integration with the OS for a true \"app\" feel and security. ",
                    "ups": 2,
                    "downs": 0
                  }
                ],
                "text": "Can you put this in layman's terms? I'm still struggling with \"why?\" on this, besides an exercise in academics. Kudos for doing this as I'm sure it's really smart, but I'm not familiar enough with the things you're referencing here to understand why you'd put so much effort into building this.",
                "ups": 0,
                "downs": 0
              }
            ],
            "text": "Perhaps, my hopes is it will eventually be faster than native browsers.  Sounds nuts but there's two things C++ renders can't do, they don't optimize live with JIT's, which, as you can see with the demo as the JIT begins optimizing subsequent render calls fall exponentially. From 2.3~seconds for the first, to around 0.6~seconds on the third run (regardless if you change the HTML to an equivelant causing a full dump of the frame and recalc).  If you consider touch, animations, layout these may initially run slower in a JS version than a browser but would get very close to their native speed. \n\nDue to the \"lambda\"-ness of javascript, code can be cut and refactored even by itself (using a safe heap in emscripten). This allows for on the fly \"self-optimizations\" using parallel processing technologies like webcl/opencl (glsl currently) to improve performance - parts of the program can be broken off from itself and calculated in parallel with a GPU. WebKit is didn't long ago finish threading its compositor and HTML parser, there's tons of things from the CSS JITTER and Z-order processing that can be done in parallel. What's incredibly unmanagable to do in C++ static code (let alone at a C++ runtime) you can quickly prototype up in javascript.\n\nEven if this results in a minor performance improvement of 7~10% you're now faster than a native C++ build (abliet, sans jitting someone could go rewrite all that webkit code and pull in threads and opencl, but trust me, its a LOT of work). \n\nBut then consider with GLSL drawing primitives you can leave behind older libraries such as skia, cairo, pixman that draw/paint everything in software. I believe chrome is racing to this end with Ganesh in skia.  But progress is slow, and hard to move forward, seeing how fast the javascript community works, completely porting all GraphicsContext commands into complete shader programs isn't improbable.\n\nFinally, you can also use linear algebra in vertex calculations and system of equations to calculate layout at nearly 48x the normal speed of a traditional render, these are big significant increases in speed that WebKit for a large part hasn't touched because layout is a hallow ground.\n\nIt seems lofty, i know. I don't really believe it myself, but being knee deep in it for the last year and a half, i'm beginning to see the line between point A and B, and its not as far as I thought.\n\n",
            "ups": 5,
            "downs": 0
          }
        ],
        "text": "Pointless? Yes.\n\nImpressive? Yes.\n\n*So meta*",
        "ups": 5,
        "downs": 0
      },
      {
        "author": "ns0",
        "replies": [
          {
            "author": "kenman",
            "replies": [
              {
                "author": "ns0",
                "replies": [
                  {
                    "author": "kenman",
                    "replies": [],
                    "text": "I have a 12gb system at home I could try it on, if you think it might work I can certainly give it a try.",
                    "ups": 1,
                    "downs": 0
                  },
                  {
                    "author": "firstEncounter",
                    "replies": [],
                    "text": "I tried it on my 16GB system with uglify-js to no avail.",
                    "ups": 1,
                    "downs": 0
                  }
                ],
                "text": "No idea, closure ends up producing invalid output.  Minify/uglifyjs2 spin up to over 8GB of memory then kapoot.",
                "ups": 2,
                "downs": 0
              }
            ],
            "text": "What's the cause of the crashes? I mean, is it bugs within those tools or just a lack of resources on your system?",
            "ups": 1,
            "downs": 0
          },
          {
            "author": "Strider96",
            "replies": [],
            "text": "Nice that you're experimenting with emscriptten! I love it!\n\nAnyway, emscripten can actually compress code it self with the --compress stub!\n\nYou can read more:\nhttps://github.com/kripken/emscripten/wiki/Compressing-Downloads",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "Brownie points for anyone who can manage to find a minimizer (including Google Closure) that can manage this.. uglifyjs2, minify and closure all crashed my computer.\n\nhttps://raw.githubusercontent.com/trevorlinton/webkit.js/master/bin/webkit.bin.js",
        "ups": 3,
        "downs": 0
      },
      {
        "author": "kenman",
        "replies": [
          {
            "author": "ns0",
            "replies": [],
            "text": "The link to report bugs, has bugs.. it's experimental :)",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "FYI, this link is misleading:\n\n&gt; Report issues to [http://github.com/trevorlinton/webkit.js/](http://trevorlinton.github.io/#)\n\nIt actually links to:\n\n    http://trevorlinton.github.io/#",
        "ups": 3,
        "downs": 0
      },
      {
        "author": "hidden-markov",
        "replies": [],
        "text": "We need to go deeper.",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "brtt3000",
        "replies": [],
        "text": "Have you tried having it run itself? Inception style?",
        "ups": 1,
        "downs": 0
      }
    ]
  },
  {
    "title": "Hammer.JS 2.0 in development...",
    "text": "",
    "link": "https://github.com/EightMedia/hammer.js/tree/2.0.x",
    "ups": 24,
    "downs": 0,
    "author": "jtangelder",
    "comments": [
      {
        "author": "daedius",
        "replies": [],
        "text": "Cool project, I hope it works with coccoonjs",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "lazyduke",
        "replies": [],
        "text": "Thank goodness. The old Hammer was such a chore to contribute to as PRs were merged before they were tested, and the code structure was tough to maintain.",
        "ups": 1,
        "downs": 0
      }
    ]
  },
  {
    "title": "Stop autoplaying your Gifs",
    "text": "",
    "link": "http://krasimirtsonev.com/blog/article/stop-autoplaying-your-gifs-stop-play-control",
    "ups": 18,
    "downs": 0,
    "author": "krasimirtsonev",
    "comments": [
      {
        "author": "frodwith",
        "replies": [
          {
            "author": "Bel-Shamharoth",
            "replies": [
              {
                "author": "honestbleeps",
                "replies": [],
                "text": "HTML5 video with GIF fallback then if you really care about IE8 and less that much.\n\nGIF is awful. it's 10x the size of an equivalent HTML5 video, it's not performant, and it wasn't made to compress photographic pictures, it's good at compressing line art.\n\nThe continued defense of GIF as a format baffles me. It's absolutely horrid.",
                "ups": 1,
                "downs": 0
              },
              {
                "author": "jezmck",
                "replies": [],
                "text": "Lynx.",
                "ups": 1,
                "downs": 0
              }
            ],
            "text": "Or we could continue to use a format guaranteed to be supported by any browser.",
            "ups": 0,
            "downs": 0
          }
        ],
        "text": "html5 video.",
        "ups": 6,
        "downs": 0
      },
      {
        "author": "unnaturalHeuristic",
        "replies": [
          {
            "author": "honestbleeps",
            "replies": [],
            "text": "yeah, the !! trick may work in the case of a null check, but a !! preceding an &amp;&amp; statement definitely seems goofy.",
            "ups": 0,
            "downs": 0
          }
        ],
        "text": "I'm not sure that i under stand the purpose of \"!!\" in [this line](https://github.com/krasimir/gifffer/blob/master/lib/gifffer.js):\n\n&gt;if(!!(c.getContext &amp;&amp; c.getContext('2d')))\n\nDoesn't \"!!\" just resolve to a truthy value? Why not just ditch both of the NOT operators and leave it?\n\n",
        "ups": 3,
        "downs": 0
      },
      {
        "author": "My-Work-Reddit",
        "replies": [],
        "text": "Imgur needs to use this.",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "gatorpower",
        "replies": [],
        "text": "better solution is to stop using animated gifs.\n\nthe code itself forces several reflows for each image, which is bad practice",
        "ups": 1,
        "downs": 0
      }
    ]
  },
  {
    "title": "Steps for Getting Started with Unit Testing AngularJS Scripts using Jasmine",
    "text": "",
    "link": "http://vitalflux.com/angularjs-7-steps-unit-testing-angularjs-scripts-jasmine/",
    "ups": 13,
    "downs": 0,
    "author": "cd2014",
    "comments": []
  },
  {
    "title": "Creating an Events Mixin",
    "text": "",
    "link": "http://www.ordinaryrobot.com/posts/events-mixin",
    "ups": 4,
    "downs": 0,
    "author": "munky_machine",
    "comments": []
  },
  {
    "title": "[x-post r/webdev] I wrote my own Angular-esque 2-way data binding library. Any tips/thoughts/critiques on my implementation?",
    "text": "",
    "link": "http://jsfiddle.net/fJYk7/4/",
    "ups": 6,
    "downs": 0,
    "author": "NBwerk",
    "comments": [
      {
        "author": "achen2345",
        "replies": [
          {
            "author": "NBwerk",
            "replies": [],
            "text": "Interesting - I didn't know about that particular problem with addEventListener. Is there a particular way you would suggest binding the events to the node properties?",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "I really don't like the idea of addEventListener in MVC and single page apps.  The problem is that the handler is never garbage collected.  If it is never garbage collected then odds are there are multiple instances of the same callback exposed to the same events each time the DOM elements are drawn to the page.  I would much rather just bind events to node properties directly so that they can be garbage collected the moment the reference to the DOM node is destroyed or when clobbered by another handler being assigned to that same event.",
        "ups": 2,
        "downs": 0
      },
      {
        "author": "lokhura",
        "replies": [
          {
            "author": "NBwerk",
            "replies": [
              {
                "author": "twberger_",
                "replies": [],
                "text": "The standard analogue to `innerText` is `textContent`, which works everywhere except IE &lt;9. There are [a few differences](https://developer.mozilla.org/en-US/docs/Web/API/Node.textContent#Differences_from_innerText) though.",
                "ups": 1,
                "downs": 0
              }
            ],
            "text": "Hmm, apparently Firefox doesn't have an 'innerText' property - I switched it to innerHTML and it works as far as I can tell. Thanks!\n\nhttp://jsfiddle.net/fJYk7/5/",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "Doesn't seem to work in Firefox, works in Chrome though.",
        "ups": 1,
        "downs": 0
      }
    ]
  },
  {
    "title": "A 15 minute interactive video introduction to Angular",
    "text": "",
    "link": "http://training.planningforaliens.com/angular/lesson-one-1.html",
    "ups": 6,
    "downs": 0,
    "author": "smrf01",
    "comments": []
  },
  {
    "title": "A comprehensive JavaScript game programming guide (work in progress)",
    "text": "",
    "link": "http://codicious.com/courses/courses_easeljs",
    "ups": 22,
    "downs": 0,
    "author": "joachimhs",
    "comments": [
      {
        "author": "lumberbrain",
        "replies": [
          {
            "author": "idrink211",
            "replies": [],
            "text": "Yeah, it's almost impossible to write a true comprehensive guide if you're considering all the \"MyCoolThing.js\" libraries and frameworks out there.",
            "ups": 1,
            "downs": 0
          },
          {
            "author": "joachimhs",
            "replies": [],
            "text": "Thank you for your feedback! I was a little torn with what to call the post here in Reddit, as I wasn't sure people would automatically associate EaselJS with games :) \n\nI think Grunt is an important tool to teach, because it becomes increasingly difficult to write larger JavaScript applications without a proper build tool. ",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "The title *should* read \"A comprehensive guide to EaselJS\", nevertheless this is a nice little guide. It's also nice to see a section on Grunt! ",
        "ups": 6,
        "downs": 0
      },
      {
        "author": "gnarvin",
        "replies": [
          {
            "author": "joachimhs",
            "replies": [],
            "text": "As I build out the chapters, I plan on adding sound effects and bitmap graphics as well. I am thinking of trying to use PreloadJS to preload all of the assets, and I am currently on the fence between SoundJS and Howler for sound support. \n\nI'm almost getting done with chapter 3, and in chapter 4 I'm going to move on to adding a title screen and keeping score between the players. ",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "Do you plan on doing more with CreateJs or just sticking to EaselJs. Would love to see more, been thinking about learning to make some simple games with javascript.",
        "ups": 1,
        "downs": 0
      }
    ]
  },
  {
    "title": "Resolving Conflicts in Orchestrate with Node.js and Hextor",
    "text": "",
    "link": "http://orchestrate.io/blog/2014/06/19/resolving-conflicts-in-orchestrate-with-hextor/",
    "ups": 2,
    "downs": 0,
    "author": "garbados",
    "comments": []
  },
  {
    "title": "Looking for feedback on my project - Mention Bin (Instantly create Twitter campaigns that target US legislators)",
    "text": "",
    "link": "http://mentionbin.com/",
    "ups": 6,
    "downs": 0,
    "author": "thomasfromcdnjs",
    "comments": []
  },
  {
    "title": "Favoring Curry -- Increase Readability",
    "text": "",
    "link": "http://fr.umio.us/favoring-curry/",
    "ups": 4,
    "downs": 0,
    "author": "agumonkey",
    "comments": [
      {
        "author": "rhysbrettbowen",
        "replies": [],
        "text": "I don't think anyone would be chaining together \"then\" only for the purpose of passing things along since \"then\" is an async process in the standard. \n\nAlso it'd be better to combine the filter and reject together. Something like:\n\n    var isIncompleteMember = R.and(R.propEq('username', membername), R.not(R.propEq('complete', true)));\n    // ...\n    R.filter(isIncompleteMember)\n\nI didn't see if R has a \"not\" but that's easy to define.",
        "ups": 1,
        "downs": 0
      }
    ]
  },
  {
    "title": "See the amazing Ember Fest speaker lineup!",
    "text": "",
    "link": "https://emberfest.eu",
    "ups": 13,
    "downs": 0,
    "author": "joachimhs",
    "comments": []
  },
  {
    "title": "7 Patterns to Refactor JavaScript Applications: Form Objects",
    "text": "",
    "link": "http://journal.crushlovely.com/post/89270334848/7-patterns-to-refactor-javascript-applications-form",
    "ups": 2,
    "downs": 0,
    "author": "createbang",
    "comments": []
  },
  {
    "title": "can someone please tell me what im doing wrong, for loop",
    "text": "it's only garbing the first elements height and repeating it\n\n    var product = $(this).find('.productItem').length;\n    var productHeight = $('.productItem').height();\n    var titleHeight = $('.item-overlay').find('p').height();\n\n    for(var i = 0; i &lt; product; i++){\n\n   \t\tconsole.log('#' + i + ' has height of ' + titleHeight);\n   \t\tconsole.log('#' + i + ' has height of ' + productHeight);\n\n   }",
    "link": "http://www.reddit.com/r/javascript/comments/28k83v/can_someone_please_tell_me_what_im_doing_wrong/",
    "ups": 2,
    "downs": 0,
    "author": "mouse40",
    "comments": [
      {
        "author": "aresdesmoulins",
        "replies": [
          {
            "author": "mouse40",
            "replies": [],
            "text": "thanks!",
            "ups": 2,
            "downs": 0
          }
        ],
        "text": "You're defining productHeight and titleHeight outside of the loop. As the loop cycles, it will update the counter i, but it is reading the same variable over and over again.",
        "ups": 2,
        "downs": 0
      },
      {
        "author": "noonches",
        "replies": [
          {
            "author": "mouse40",
            "replies": [],
            "text": "huge thanks!\n\n",
            "ups": 2,
            "downs": 0
          }
        ],
        "text": "Try this\n\n    $(this).find('.productItem').each(function(index, item){\n         console.log('#' + index + ' has height of ' + $(item).height());\n    });\n\n\nIt's only grabbing the first element's height because that's all productHeight or titleHeight is ever set to.",
        "ups": 3,
        "downs": 0
      }
    ]
  },
  {
    "title": "Creating Graphs and Charts using Chart.js",
    "text": "",
    "link": "http://www.i-visionblog.com/2014/04/working-with-chartjs.html",
    "ups": 3,
    "downs": 0,
    "author": "mssrivathsan",
    "comments": []
  },
  {
    "title": "Are there any good, narrative articles or books about the invention of Javascript?",
    "text": "Would like to read it",
    "link": "http://www.reddit.com/r/javascript/comments/28ixc9/are_there_any_good_narrative_articles_or_books/",
    "ups": 14,
    "downs": 0,
    "author": "keeferc",
    "comments": [
      {
        "author": "more_exercise",
        "replies": [
          {
            "author": "has_all_the_fun",
            "replies": [],
            "text": "He also did loads of talks about it at Javascript conferences.",
            "ups": 1,
            "downs": 0
          },
          {
            "author": "keeferc",
            "replies": [],
            "text": "Wow, in a week? That's so cool. I bet the story leading up to it is pretty interesting. Lots of good suggestions in this thread to check out. Many programmers write well, of course, but I do wish professional authors and magazine writers would dig into this stuff more often.",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "You might find articles, but \"Brendan Eich banged it out during the course of a week, then eventually we formed a committee to govern it.\" doesn't really a whole book make.",
        "ups": 12,
        "downs": 0
      },
      {
        "author": "rauschma",
        "replies": [],
        "text": "I have written a blog post that should be close to what you are looking for. It includes a list of sources with further information: [JavaScript: how it all began](http://www.2ality.com/2011/03/javascript-how-it-all-began.html)\n",
        "ups": 6,
        "downs": 0
      },
      {
        "author": "uniqueusername37",
        "replies": [],
        "text": "I quite enjoyed this foreword by Brendan Eich in a nodejs guide..\n\nhttp://chimera.labs.oreilly.com/books/1234000001808/pr02.html",
        "ups": 5,
        "downs": 0
      },
      {
        "author": "Jayomat",
        "replies": [],
        "text": "There are series of Douglas crock for on YouTube where he basically does that + some basic js",
        "ups": 4,
        "downs": 0
      },
      {
        "author": "bart2019",
        "replies": [],
        "text": "As I recall, it started out as a scripting language for command line scripts, called Cmm (C minus minus), in the 1990s. No, [not this](https://code.google.com/p/cmm-lang/), I don't think, [nor this ](https://ghc.haskell.org/trac/ghc/wiki/Commentary/Compiler/CmmType); apparently, the name has been recycled. Repeatedly.\n\nSee [this](http://p2p.wrox.com/intro-programming/44627-scripting-languages.html#post174596) for a compact writeup on Cmm the precursor to Javascript.",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "Magnusson",
        "replies": [],
        "text": "The history of JS and ECMAScript is covered in some detail in [Professional JavaScript for Web Developers](http://www.amazon.com/Professional-JavaScript-Developers-Nicholas-Zakas/dp/1118026691).",
        "ups": 2,
        "downs": 0
      }
    ]
  },
  {
    "title": "How to use Highchart in your web application?",
    "text": "",
    "link": "http://tisuchi.com/how-to-use-highchart-in-your-web-application/",
    "ups": 2,
    "downs": 0,
    "author": "tisuchi",
    "comments": []
  },
  {
    "title": "Why isn't r/node in the sidebar?",
    "text": "Kinda silly seeing its actually javascript, yet r/php is there....",
    "link": "http://www.reddit.com/r/javascript/comments/28hlce/why_isnt_rnode_in_the_sidebar/",
    "ups": 48,
    "downs": 0,
    "author": "drunkcatsdgaf",
    "comments": [
      {
        "author": "MadCapitalist",
        "replies": [
          {
            "author": "drunkcatsdgaf",
            "replies": [
              {
                "author": "brotherwayne",
                "replies": [
                  {
                    "author": "bwaxxlo",
                    "replies": [],
                    "text": "They should use a non-blocking pattern then",
                    "ups": 38,
                    "downs": 0
                  },
                  {
                    "author": "drunkcatsdgaf",
                    "replies": [
                      {
                        "author": "brotherwayne",
                        "replies": [],
                        "text": "Relevant thread, in case anyone wants to see it: http://www.reddit.com/r/node/comments/27sk72/why_are_there_two_nodejs_subreddits/",
                        "ups": 3,
                        "downs": 0
                      }
                    ],
                    "text": "haha, yeah its actually been recently, some of the mods didnt even know the other existed &gt;.&lt;",
                    "ups": 10,
                    "downs": 0
                  }
                ],
                "text": "(slowly, apparently)",
                "ups": 12,
                "downs": 0
              },
              {
                "author": "bittered",
                "replies": [],
                "text": "Mod/creator of /r/node here. I've been talking to a /r/nodejs mod (/u/s5fs) but it's really up to the /r/nodejs creator (/u/kahwee) to decide whether it makes sense for their subreddit or not.",
                "ups": 3,
                "downs": 0
              }
            ],
            "text": "the mods are in talks.",
            "ups": 6,
            "downs": 0
          }
        ],
        "text": "And r/nodejs as well. It would be nice if the two boards were consolidated.",
        "ups": 14,
        "downs": 0
      },
      {
        "author": "ChristianBundy",
        "replies": [
          {
            "author": "has_all_the_fun",
            "replies": [],
            "text": "wow, http://i.imgur.com/DKxfHXy.gif",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "[/r/node+nodejs](/r/node+nodejs)",
        "ups": 5,
        "downs": 0
      },
      {
        "author": "kenman",
        "replies": [
          {
            "author": "Waterkloof",
            "replies": [],
            "text": "Please use the link recommended by /u/ChristianBundy \n\n&gt; /r/node+nodejs",
            "ups": 3,
            "downs": 0
          }
        ],
        "text": "I planned to do some fairly-minor updates to the sub this coming weekend, I can certainly add it (or whichever is chosen as \"the\" NodeJS sub).\n\nOther things on the todo list:\n\n* add /r/frontend, maybe others (open to suggestions)\n* remove the twitter link (unused in almost 2 years)\n* unsticky the sticky post since it's too old to be commented on\n* think of something else to sticky (open to suggestions)\n* maybe remove w3fools link (I think it's served its purpose, see w3fools.com for details)\n* add links to the ES/ECMA specs? (not sure which one(s) to link though)\n\nAlso, do we need a custom icon/logo thingy? I don't think we have one, but there's not an official logo and I'm not real keen on the [unofficial logo](http://en.wikipedia.org/wiki/JavaScript#mediaviewer/File:Unofficial_JavaScript_logo_2.svg). I'd never see it though (subreddit css is disabled), so it really doesn't matter to me.\n\nFeel free to lob any other ideas/suggestions/complaints at me while we're on the subject!",
        "ups": 3,
        "downs": 0
      },
      {
        "author": "a0viedo",
        "replies": [
          {
            "author": "paincoats",
            "replies": [
              {
                "author": "a0viedo",
                "replies": [],
                "text": "how come php is a \"related subreddit\", then? last time i check it was a language too",
                "ups": 1,
                "downs": 0
              }
            ],
            "text": "Because the side bar is for related subreddits, it's not a list of 'languages I think are cool'",
            "ups": 2,
            "downs": 0
          },
          {
            "author": "diag",
            "replies": [
              {
                "author": "Jazzza001",
                "replies": [],
                "text": "Opening a whole can of worms.",
                "ups": 4,
                "downs": 0
              },
              {
                "author": "paincoats",
                "replies": [
                  {
                    "author": "pegasus_527",
                    "replies": [
                      {
                        "author": "paincoats",
                        "replies": [],
                        "text": "i don't know the wankery, but i have heard much.. my sympathies",
                        "ups": 1,
                        "downs": 0
                      },
                      {
                        "author": "has_all_the_fun",
                        "replies": [],
                        "text": "Thought the haskell community was considered really helpful?",
                        "ups": 1,
                        "downs": 0
                      }
                    ],
                    "text": "As someone who is trying to learn Haskell and thus participates in that community, you have NO IDEA what true programming language wankery looks like.",
                    "ups": 1,
                    "downs": 0
                  }
                ],
                "text": "I like php\n\nPhp users don't wank on and on about it like (a small, loud minority of) node and Ruby on Rails users\n\n\"ooooh node is sooo cooool look at me using javascript oooh fuck me on github\"",
                "ups": 5,
                "downs": 0
              },
              {
                "author": "bart2019",
                "replies": [],
                "text": "The real question is: what's the connection with PHP?\n\nThey're both programming languages for the web. That's it. And that isn't much. Not enough for me to call it a \"related subreddit\".",
                "ups": 2,
                "downs": 0
              }
            ],
            "text": "What's with the PHP hate?",
            "ups": 3,
            "downs": 0
          }
        ],
        "text": "php? really? I would change it for ruby or something like that. And of course, r/node in the first place.",
        "ups": -11,
        "downs": 0
      },
      {
        "author": "bignothing",
        "replies": [],
        "text": "i like that php is there. ",
        "ups": -3,
        "downs": 0
      },
      {
        "author": "nschubach",
        "replies": [
          {
            "author": "drunkcatsdgaf",
            "replies": [
              {
                "author": "robotparts",
                "replies": [
                  {
                    "author": "drunkcatsdgaf",
                    "replies": [
                      {
                        "author": "AnimusNecandi",
                        "replies": [],
                        "text": "It's not your fault, English is the PHP of natural languages.",
                        "ups": 2,
                        "downs": 0
                      }
                    ],
                    "text": "derrr, no I actually try my best but today my head is spinning from allergies, thanks for catching this.",
                    "ups": 2,
                    "downs": 0
                  }
                ],
                "text": "Funnily, you used the only form of \"there/their/they're\" that doesn't work in that sentence.\n\n\"They're\" is obviously correct, but even \"there\" could have been technically correct if it refers to the location of the sidebar.\n\nI doubt you care about grammar much, but I just thought I would point out an instance of misuse that is funnier than most.",
                "ups": 1,
                "downs": 0
              }
            ],
            "text": "its helpful for newbs, specially if they're looking for other subs.\n   \nEDIT: I failed english.",
            "ups": 4,
            "downs": 0
          }
        ],
        "text": "I find sidebars to be unreliable at best.  It will probably get added when the mods get around to it now that you brought it up, but I never really rely on it.",
        "ups": -7,
        "downs": 0
      },
      {
        "author": "steveob42",
        "replies": [
          {
            "author": "blazedd",
            "replies": [
              {
                "author": "steveob42",
                "replies": [
                  {
                    "author": "blazedd",
                    "replies": [
                      {
                        "author": "Zaemz",
                        "replies": [
                          {
                            "author": "blazedd",
                            "replies": [],
                            "text": "Yeah, that's true. I mis-worded that.",
                            "ups": 1,
                            "downs": 0
                          },
                          {
                            "author": "itsnotlupus",
                            "replies": [],
                            "text": "This man is right!  \nWe must link to /r/cpp right away!",
                            "ups": 1,
                            "downs": 0
                          },
                          {
                            "author": "x-skeww",
                            "replies": [],
                            "text": "V8 actually does contain a over 0.5 MB of JS though.",
                            "ups": 1,
                            "downs": 0
                          }
                        ],
                        "text": "Just to be a pedant, node is not built in JavaScript.",
                        "ups": 3,
                        "downs": 0
                      }
                    ],
                    "text": "But this isn't /r/php this is /r/javascript and node is built in javascript. Therefore your point is still moot.",
                    "ups": 11,
                    "downs": 0
                  }
                ],
                "text": "Yes but single-systemitis isn't a good thing, endorsing php makes sense in the bigger picture IMHO.",
                "ups": -15,
                "downs": 0
              }
            ],
            "text": "This is a moot point. Node still runs on javascript and is relevant to the language. \n\nedit: a word",
            "ups": 10,
            "downs": 0
          },
          {
            "author": "drunkcatsdgaf",
            "replies": [
              {
                "author": "x-skeww",
                "replies": [
                  {
                    "author": "drunkcatsdgaf",
                    "replies": [],
                    "text": "Hell, you can most small apps for free, doesnt matter on what language",
                    "ups": 4,
                    "downs": 0
                  }
                ],
                "text": "A VPS is like $5/m nowadays. PHP's cheap hosting advantage is gone.",
                "ups": 8,
                "downs": 0
              },
              {
                "author": "steveob42",
                "replies": [
                  {
                    "author": "drunkcatsdgaf",
                    "replies": [
                      {
                        "author": "steveob42",
                        "replies": [
                          {
                            "author": "drunkcatsdgaf",
                            "replies": [],
                            "text": "Node isn't just for server programming, frontend devs use it all the time for preprocessing, testing, etc. Our backend is written in haskell ;)\n   \nEDIT: you still haven't explained how I am reinventing the wheel.",
                            "ups": 4,
                            "downs": 0
                          },
                          {
                            "author": "Jdonavan",
                            "replies": [
                              {
                                "author": "mrahh",
                                "replies": [],
                                "text": "A hahahahaha. Just doing his part to try and keep the php stack in play for modern web dev.\n\nAfter learning c++ as my first foray into programming, php and node are both weird, but node at least with node I can look at someone else's code and find my way around. I feel like I'm wading through an unfinished corn maze in php. ",
                                "ups": 2,
                                "downs": 0
                              },
                              {
                                "author": "colordrops",
                                "replies": [
                                  {
                                    "author": "Jdonavan",
                                    "replies": [
                                      {
                                        "author": "colordrops",
                                        "replies": [
                                          {
                                            "author": "Jdonavan",
                                            "replies": [],
                                            "text": "Do you really need me to reiterate points you already know?  Next you're going to start making a case for Visual Basic.",
                                            "ups": 1,
                                            "downs": 0
                                          }
                                        ],
                                        "text": "&gt; fractal of bad design\n\nYou are just parroting some blogger without saying anything of substance",
                                        "ups": 1,
                                        "downs": 0
                                      }
                                    ],
                                    "text": "PHP is a fractal of bad design.  That people can be successful in spite of that fact doesn't change the fact that the language is dreadful. ",
                                    "ups": 1,
                                    "downs": 0
                                  }
                                ],
                                "text": "If you think PHP on the backend is naive, you haven't heard of Haxl, HipHop, Zend2, Symfony, PHP-FIG, or Composer.",
                                "ups": 1,
                                "downs": 0
                              }
                            ],
                            "text": "Dude... You're a PHP shop the very definition of naive server programmers.",
                            "ups": 5,
                            "downs": 0
                          }
                        ],
                        "text": "So you willingly use naive server programmers, and that makes it awesome (and I'm the one having a bad time?!?).  \n\nWe use JavaScript on browsers because we HAVE to, it is far from ideal or productive compared to mature server products.  If anything the push should be for a better browser language.\n\n",
                        "ups": -6,
                        "downs": 0
                      }
                    ],
                    "text": "Explain how im reinventing the wheel with node? Are you going to be one of those people who says \"Well Twisted has done that for X years\", because I know.\n   \n   \nEDIT: I use node because other people dont know other languages, not because I dont. If i had my way, all our code would be C++. With that said, youre talking to someone who has used the v8 system exclusively outside of node and included to other projects, so please, enlighten me. ",
                    "ups": 4,
                    "downs": 0
                  }
                ],
                "text": "If you don't care about the costs, then I'm not surprised you would completely reinvent the wheel w/node, just so you don't have to learn another language.  HARDLY the only concern w/node, there is a huge list of issues w/it.",
                "ups": -17,
                "downs": 0
              }
            ],
            "text": "if your concerns are cheap hosting, youre already going to have a bad time.",
            "ups": 13,
            "downs": 0
          },
          {
            "author": "mrahh",
            "replies": [],
            "text": "Since when is it expensive to host something running node?",
            "ups": 2,
            "downs": 0
          },
          {
            "author": "Iggyhopper",
            "replies": [],
            "text": "Wow really? Setting up nginx with node, and coding some javascript is really fucking easy. Not to mention the coding standards are similar to every other language, unlike PHP...",
            "ups": 3,
            "downs": 0
          },
          {
            "author": "paincoats",
            "replies": [],
            "text": "PHP? That's not node. Why would you use a language that has been used on millions of sites worldwide when you can use a trendy javascript runtime? Next you'll tell me your personal website's TLD isn't .io.",
            "ups": -1,
            "downs": 0
          }
        ],
        "text": "because node is lame, try php with xdebug and eclipse for slapping server code together quickly and gobs of inexpensive hosting options.",
        "ups": -31,
        "downs": 0
      }
    ]
  },
  {
    "title": "Replicating CouchDB to Orchestrate",
    "text": "",
    "link": "http://orchestrate.io/blog/2014/06/18/replicating-couchdb-to-orchestrate/",
    "ups": 5,
    "downs": 0,
    "author": "doc_plosker",
    "comments": []
  },
  {
    "title": "Flatris, a web-based Tetris clone built with Cosmos/React components",
    "text": "",
    "link": "http://skidding.github.io/flatris/",
    "ups": 13,
    "downs": 0,
    "author": "skidding",
    "comments": [
      {
        "author": "LateDentArthurDent2",
        "replies": [
          {
            "author": "skidding",
            "replies": [],
            "text": "It is disabled using https://github.com/skidding/flatris/blob/master/index.html#L6. Works for iOS, what device did you test on?",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "You need to disable zooming for mobile devices. It makes it nearly impossible to play if you quickly click (as you do in tetris). ",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "lazyduke",
        "replies": [
          {
            "author": "skidding",
            "replies": [],
            "text": "You're right, it is a bit silly. The main purpose on this project was not the game itself, but to showcase web technologies that seamlessly generate DOM for your data structures without ever having to touch it yourself (jQuery style). It's more of a \"if you can make a game so easily, building generic user interfaces is a piece of cake\" proof of concept",
            "ups": 2,
            "downs": 0
          }
        ],
        "text": "It seems a little silly to use the DOM for this, but hey, it works.",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "LateDentArthurDent2",
        "replies": [],
        "text": "HTC One ",
        "ups": 1,
        "downs": 0
      }
    ]
  },
  {
    "title": "Stop Using Transpilers",
    "text": "",
    "link": "http://www.hakkalabs.co/articles/stop-using-transpilers-javascript-features",
    "ups": 0,
    "downs": 0,
    "author": "BKDev",
    "comments": [
      {
        "author": "Mortsubite",
        "replies": [
          {
            "author": "moljac024",
            "replies": [],
            "text": "Was about to point of how ironic the title is ;)\n\nEDIT: AFAIK there should be some ES6 features already available in latest Chrome and/or Firefox",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "ES6 isn't out yet. Literally, the only way to use any ES6 features in browser is to use a transpiler o.O",
        "ups": 2,
        "downs": 0
      }
    ]
  },
  {
    "title": "Safe integers in JavaScript",
    "text": "",
    "link": "http://www.2ality.com/2013/10/safe-integers.html",
    "ups": 39,
    "downs": 0,
    "author": "Uberhipster",
    "comments": [
      {
        "author": "OysterCat",
        "replies": [
          {
            "author": "rauschma",
            "replies": [
              {
                "author": "tach4n",
                "replies": [],
                "text": "Indeed. I've been writing system libraries for a JS VM that targets 64bit systems and a number of APIs expect/return 64 bit ints - I ended up just hacking some minimal support into the engine to (partially) work around it.",
                "ups": 1,
                "downs": 0
              }
            ],
            "text": "Yes and no. No, because most JavaScript engines already use actual integers internally if code only works with fractionless numbers. Yes, because JavaScript cant handle 64 bit integers. That causes problems with various APIs, especially ones with integer keys: databases, Twitter, etc. Adding integers to the language is relatively complex, but still a priority. It may happen as early as ECMAScript 7 (in about 2 years).",
            "ups": 3,
            "downs": 0
          },
          {
            "author": "Rhomboid",
            "replies": [
              {
                "author": "JL235",
                "replies": [
                  {
                    "author": "Rhomboid",
                    "replies": [
                      {
                        "author": "sheetjs",
                        "replies": [
                          {
                            "author": "Rhomboid",
                            "replies": [],
                            "text": "A timestamp of that kind is of the order of magnitude of about 2^(57), which means by using a IEEE double with 53 bits of mantissa you lose approximately 4 bits of precision, meaning you're within 1600 ns or 1.6 &amp;micro;s which is far within the margin of accuracy of most system clocks.  If you really need full precision you can use a typed array consisting of two 32 bit integers and do any addition or subtraction as a pair of operations.  It's only a couple extra lines of code -- you'll notice that the Win32 API even was designed specifically to work like this by having the `FILETIME` structure consist of two `DWORD` fields, because prior to C99's introduction of `long long` there was no guaranteed support for 64 bit integer math in C, so the platform had to be usable by C90 compilers that didn't have it.  (MSVC prior to VS2013 only supported C90, but it did at least gain a non-standard 64 bit integer type somewhere along the way.)\n\nAgain, I repeat -- lack of 64 bit integers has never prevented anyone from doing anything on the web.\n",
                            "ups": 4,
                            "downs": 0
                          }
                        ],
                        "text": "&gt; Again, it's relatively rare that you need to use 64 bit integers in a web browser. If you're dealing with database IDs or other types of identifiers, just leave them as strings. If you're doing hashing or crypto, then you're probably going to need a BigInt library anyway for other reasons.\n\nThere are a whole host of problems (e.g. parsing documents -- in Windows, file times are stored as 64-bit integers**) where 64-bit integer support is required but a full blown arbitrary-precision math library is overkill.\n\n ** http://msdn.microsoft.com/en-us/library/windows/desktop/ms724290.aspx\n\n&gt; A file time is a 64-bit value that represents the number of 100-nanosecond intervals that have elapsed since 12:00 A.M. January 1, 1601 Coordinated Universal Time (UTC)",
                        "ups": 3,
                        "downs": 0
                      },
                      {
                        "author": "denilsonsa",
                        "replies": [],
                        "text": "&gt; Again, it's relatively rare that you need to use 64 bit integers in a web browser.\n\nYou are forgetting about modern web applications.\n\nFor a web page, sure, no need for 64-bit integers. For a web application that uses local storage, encrypts data client-side, handles binary arrays, uses web sockets, or whatever stuff you can think of; then a true 64-bit integer type is useful or even needed.",
                        "ups": 2,
                        "downs": 0
                      }
                    ],
                    "text": "Again, it's relatively rare that you need to use 64 bit integers in a web browser.  If you're dealing with database IDs or other types of identifiers, just leave them as strings.  If you're doing hashing or crypto, then you're probably going to need a BigInt library anyway for other reasons.\n\nI posit that the lack of 64 bit integers has never actually prevented anyone from doing something in a browser that they wanted to do.  If it had, then the clamors of the masses would have convinced browser implementers to support it.  That is, after all, how new features make their way into the browser -- by people recognizing a need that is not being fulfilled and championing it.  And of course the usual problem arises that even if you implement something today, in one browser, it will take several years and all the other browsers following suit before the feature has a chance of being widely useful, so you're going to be stuck with fallback methods anyway.\n\n",
                    "ups": 3,
                    "downs": 0
                  }
                ],
                "text": "But 64-bit integers are the type that shouldn't need a whole library. At least if it is done through a library, it should be offered by the browser, with the aim of optimizing most of it away (so you are left with a 64-bit integer for most of the time).",
                "ups": 4,
                "downs": 0
              }
            ],
            "text": "Web browsers have supported actual integers through [typed arrays](http://www.khronos.org/registry/typedarray/specs/latest/) for several years.  What they don't provide is a 64 bit integer type, but any code that needs such a capability (which is relatively rare in the context of a browser) can implement it through a BigInt library just like in any other language.\n",
            "ups": 5,
            "downs": 0
          }
        ],
        "text": "Why is this even an issue? JavaScript needs an actual integer type.",
        "ups": 8,
        "downs": 0
      },
      {
        "author": "jdfellow",
        "replies": [],
        "text": "Of course this range for \"safe integers\" applies to all 64 bit (double) floating point numbers in all languages.\n\nAFAIK, Bitcoin uses a double to track account values, in satoshis. Which seems strange to do in a financial app but since the total number of satoshis (21e14) is less than 2^53 it works.",
        "ups": 5,
        "downs": 0
      },
      {
        "author": "i_invented_the_ipod",
        "replies": [
          {
            "author": "x-skeww",
            "replies": [],
            "text": "&gt; Putting things like this into the language standard is a waste of time.\n\nWell, there also is no need for `else` or having more than one loop construct.\n\nYou can also write your own `parseInt` or `max`/`min` functions. Many functions can be implemented without low-level system calls.\n\nNow, the problem with doing everything yourself is that you have to write it, test it, fix it, and document it.\n\nAlso, if you make your own `MAX_SAFE_INTEGER` constant, where would you keep it? Stick it into `Number`? Your code conventions may disallow this. To make matters worse, modifying built-ins can break some of the heuristics, which in turn can degrade performance.\n\nOther languages do have similar constants for the min/max values. It makes sense that JavaScript has something like that, too.",
            "ups": 2,
            "downs": 0
          },
          {
            "author": "radhruin",
            "replies": [],
            "text": "isSafeInteger operates on doubles (NaN, infinity issues, not constrained to range of 32 bit integer) and handles standard built-in API contracts (handles all types, uses internal ToInteger operation) I'm happy this exists. It might be 6 lines, but it's subtle code and would definitely be a source of bugs if hand-written.\n\nAnyway, 64-bit integers are coming. It just turns out that they are many orders of magnitude more difficult to design than adding quick utility methods like Number.isSafeInteger.",
            "ups": 3,
            "downs": 0
          }
        ],
        "text": "&gt; ECMAScript 6 will probably provide the following constants\n&gt; [...]\n&gt; It will also provide a function for determining whether an integer is safe\n\nAnd here's the problem with a lot of ES6, right there. Anybody who could understand what the point of these constants and functions are, are perfectly-capable of writing them as well. It's six lines of code. Putting things like this into the language standard is a waste of time.\n\nIf ES6 wanted to allow leeway for implementations to provide an actually-useful native 64-bit integer type, that'd be one thing. But as long as the \"every number is a double\" idea sticks around, this is totally worthless.",
        "ups": 2,
        "downs": 0
      },
      {
        "author": "tech_tuna",
        "replies": [],
        "text": "There is no safety in JavaScript.  :)",
        "ups": 1,
        "downs": 0
      },
      {
        "author": "[deleted]",
        "replies": [
          {
            "author": "nschubach",
            "replies": [],
            "text": "It's _so_ 10 months ago.",
            "ups": 4,
            "downs": 0
          }
        ],
        "text": "[deleted]",
        "ups": -6,
        "downs": 0
      }
    ]
  },
  {
    "title": "A Criticism of JavaScript Cryptography",
    "text": "",
    "link": "http://bren2010.github.io/jekyll/update/2014/06/17/javascript-crypto.html",
    "ups": 7,
    "downs": 0,
    "author": "koglerjs",
    "comments": []
  },
  {
    "title": "Multiple return values in ECMAScript 6",
    "text": "",
    "link": "http://www.2ality.com/2014/06/es6-multiple-return-values.html",
    "ups": 14,
    "downs": 0,
    "author": "skiskilo",
    "comments": []
  },
  {
    "title": "Structs and ImmutableStructs",
    "text": "",
    "link": "http://raganwald.com/2014/06/15/immutable-structs.html",
    "ups": 11,
    "downs": 0,
    "author": "homoiconic",
    "comments": [
      {
        "author": "brtt3000",
        "replies": [
          {
            "author": "homoiconic",
            "replies": [],
            "text": "Works perfectly for an immutable struct, less so for a struct that is closed for modification but open for extension. There are some use cases for that.",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "What about `Object.freeze()` ?\n\n&gt; The Object.freeze() method freezes an object: that is, prevents new properties from being added to it; prevents existing properties from being removed; and prevents existing properties, or their enumerability, configurability, or writability, from being changed. In essence the object is made effectively immutable. The method returns the object being frozen.\n\nhttps://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/freeze\n\n",
        "ups": 3,
        "downs": 0
      },
      {
        "author": "vjeux",
        "replies": [
          {
            "author": "homoiconic",
            "replies": [],
            "text": "Excellent example, thank you!",
            "ups": 1,
            "downs": 0
          }
        ],
        "text": "\"To be of benefit, immutable data structures (like immutable structs) are only of benefit is we can turn them up to eleven and realize some new benefit\". If you are using React, a benefit you get is to be able to implement shouldComponentUpdate and avoid re-rendering that entire sub-tree if nothing changed.",
        "ups": 3,
        "downs": 0
      },
      {
        "author": "homoiconic",
        "replies": [
          {
            "author": "has_all_the_fun",
            "replies": [],
            "text": "Oooh, I liked your first appearance on jsj. Going to listen the shit out of this one. ",
            "ups": 2,
            "downs": 0
          }
        ],
        "text": "(Related) This JavaScript Jabber podcast touches briefly on the subject of immutability: http://javascriptjabber.com/113-jsj-community-dynamics-with-reginald-braithwaite/",
        "ups": 3,
        "downs": 0
      },
      {
        "author": "kenman",
        "replies": [
          {
            "author": "homoiconic",
            "replies": [],
            "text": "p.s. Thanks for pointing out the errors: https://github.com/raganwald/raganwald.github.com/commit/c463e62e72196107c0f365600e6a7246dc43f61d?short_path=d0adfa7#diff-d0adfa78e84658e9078745b56d16f518",
            "ups": 3,
            "downs": 0
          },
          {
            "author": "homoiconic",
            "replies": [],
            "text": "&gt; the code I commonly work with is superficially not very compatible with the concepts, so I feel like there are larger, fundamental challenges that I'd need to overcome before I could do it properly.\n\nI think you've hit the key point. Some ideas from other languages and/or communities can be applied in small doses. Others demand a heavy commitment in order to really boost productivity.\n\nIs it worth it? I dunno, but I generally think that being aware of these techniques is always a benefit, even if you don't choose to do a radical redesign of your next project.",
            "ups": 2,
            "downs": 0
          }
        ],
        "text": "Some grammar errors (I think) near the end; sorry, too lazy to open an issue...\n\n&gt; Taking this same reasoning to immutable structures, some would argue that the extra infrastructure required to create immutable structs is not warranted `is` the sole objective `to` to prevent inadvertent errors.\n\ns/is the/if the/ ?\n\ns/to to/is to/ ?\n\n&gt; To be of benefit, immutable data structures (like immutable structs) are only of benefit `is` we can turn them up to eleven and realize some new benefit, if we incorporate paradigms like copy-on-write and build high-performance and high-reliability code around immutable data.\n\ns/is we/if we/ ?\n\n----\n\nOtherwise, I enjoyed the article. I think I need to learn some Clojure or similar, because I can often see the utility in what you write, but the code I commonly work with is superficially not very compatible with the concepts, so I feel like there are larger, fundamental challenges that I'd need to overcome before I could do it properly.",
        "ups": 2,
        "downs": 0
      }
    ]
  }
]